{
    "name": "LorettaLossEvents",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Loretta",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                 {
      					  "NameOfScene": "Glovejob",
      					  "theScene": [
                      "With the last bit of white splooge helplessly leaking from your cock onto your stomach, Loretta lets go of your cock. The respite is both welcome and unpleasant, as your still erect cock needily throbs for more pleasure.",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Speaks", "Huhuh...♥",
                      "ChangeImageLayer", "Base", "1", "BaseNoGlove",
                      "Looking you in the eye smugly, Loretta pulls off the cum-stained silky glove from her hand. With now bare hand, she firmly grips your balls and brings her lips to you ear.",
                      "Speaks", "You know... Those needles made your blood taste bad for a while...",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "So I'll be playing with {i}these{/i} for a while.",
                      "She squeezes your testicles firmly with her cool hand. Still unable to lift a finger from paralysis, and so completely in her grasp, you feel extremely vulnerable. But your predicament only serves to excite you, your cock growing shamefully hard and leaking precum on the cold stone floor.",
                      "ChangeImageLayer", "Expression", "1", "BashfulGrin",
                      "Speaks", "I see you don't mind, huhu...♥",
                      "Loretta shifts and steps behind you, putting her hands under your arms and pulling you back. Still paralyzed stiff, you start helplessly falling down into her embrace, quite worried that she will drop you...",
                      "Surprisingly enough, Loretta lays you to the ground with gentle care, proceeding to cuddle up to your side before putting her glove on your stomach. The stone floor is quite cold, and so is her body, but the needy heat in your loins keeps you quite warm.",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Loretta pokes at the cum-stained glove and looks up to you with a smug smile, her fangs digging into her soft lower lip.",
                      "Speaks", "Since you came all over it... let's have you fill the insides next.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "With a wide grin, Loretta pulls the cum-smeared glove over your cock. The silky cloth fits snugly around your engorged erection, slightly warm and damp with her sweat, and your cum. Your dick throbs needily in response, enjoying its tight confinement.",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Speaks", "Huhu... it looks ridiculous. And such a look fits you best, loser 'Hero'.♥",
                      "She grips your balls again, drawing a low, pleasured whine from you as your cock starts throbbing from her touch, trapped in the silky prison of her glove. She coos and massages your jewels insistently, the firm grasp of her dainty fingers feeling divine on your already aching nuts.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "That was a nice moan. One more!",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Her hand squeezes down harder, a pleasurable but worrisome pressure attacking your vulnerable testicles. You can't manage to hold back another moan, clearly pleasing the haughty vampire who starts giggling softly in response.",
                      "Speaks", "Men belong to their dicks, but with your precious, fragile balls, you are even easier to control.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "Now let's make you cum.",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "She starts to methodically squeeze, pull and bounce your heavy, rapidly-filling testes in her soft hand. Your dick throbs and bounces wildly, drooling sticky precum into the silky glove, neglected and eager for more stimulation, your arousal already unbearable.",
                      "Moaning loudly, you actually manage to thrust your hips upward, the paralytic effects of her needle seemingly going away. Loretta emotes in surprise, cackling at your efforts.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "Huhu, you can move already? Is your desire to have sex with my glove {i}that{/i} strong?♥",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Speaks", "Go ahead then, do your best.♥ Swing those hips and fuck my glove as I bully your precious balls.♥",
                      "You groan from her abuse, but can't deny your ever-growing excitement from the harsh words, and the silky smooth insides of her glove do feel quite amazing. Eager for release, you howl and thrust upwards like a lust-mad animal, but in the end remain in complete control of her squeezing hand.",
                      "ChangeImageLayer", "Expression", "1", "BashfulGrin",
                      "Speaks", "Quite the animal, aren't we? That desperate, you look so lame.♥ Do that again.♥",
                      "Not in control of yourself, you can't really deny her demand, pathetically humping the air with her glove stuck to your erection. The fingers flap around wildly, wet slapping noises filling the cavern as the cum-soaked piece of cloth flaps around your needily thrusting cock.",
                      "ChangeImageLayer", "Expression", "1", "CrimsonGaze",
                      "Speaks", "Good, good! Now let's see you cum! Shake those hips and impregnate my glove, you dumb animal!",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Arching your back you groan and finally manage to cum, powerfully and wildly, spraying a huge serving of scaldingly hot seed into the luxuriously soft glove. Loretta's previously firm grasp on your balls loosens up, as she softly massages your unloading testes, guiding you through your animalistic orgasm.",
                      "As your orgasm subsides, you collapse on the floor in exhaustion, her sperm-soaked glove falling dirtily on your stomach with a loud splat. As your consciousness dims, you watch Loretta's rosy lips whisper to you...",
                      "ChangeImageLayer", "Expression", "1", "EnchantingGaze",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Pain", "3",
                      "ChangeSensitivity", "Sex", "3",
                      "GameOver"
                    ]
                  },
                  {
                    "NameOfScene": "AmazonLoss",
                    "theScene": [
                      "As the last of your resistance spurts weakly into her hellishly tight pussy, Loretta lifts her hips, as if already sensing your utter defeat. Your cock slips out of her over-filled pussy and falls down, flaccid and defeated.",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Speaks", "Hmph, no stamina at all.",
                      "Putting two fingers over her pussy, Loretta spreads its lips wide open, showing off how much you filled it with your thick splooge. A stream of sticky ivory leaks outside, splattering down unto your thoroughly drained cock.",
                      "Speaks", "Lookie here, 'Hero'. Is this the extent of your resolve? Is surrendering your pitiful seed to monsters your real goal?",
                      "You clench your teeth and look away in shame, drawing an amused cackle from the evil vampiress. The erotic sight, added to her verbal assault and the cum dripping on your cock, is enough to start getting you hard again.",
                      "Speaks", "Huhu, feeling shamed? Frustrated? That's all because you're a pervert. A pervert in denial.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "Oh, but look at this thing down here. Getting a stiffy again? At least your sorry thing is honest, unlike you...",
                      "Loretta drops her hips again, this time trapping your cock between her thighs, pressing your shaft against her soft pussy. You moan weakly in protest, involuntary thrusting your hips and trying to rub yourself over her wet slit, but the dominant priestess doesn't reciprocate.",
                      "ChangeImageLayer", "Expression", "1", "EvilSmile",
                      "Speaks", "Your weak, losing cock doesn't deserve my pussy. I will squeeze it dry with my thighs. I am sure you agree, that it's good enough for a loser 'Hero' like yourself.",
                      "She starts moving her legs in alternating fashion, her soft, meaty thighs squeezing your already hard prick from all directions. You moan from the sudden onset of pleasure on your sensitive, post-orgasmic cock, which already starts leaking more precum.",
                      "ChangeImageLayer", "Expression", "1", "CrimsonGaze",
                      "Speaks", "See? It's already begging to shoot more. Loose, weak, pathetic cock! Even my thighs are too good for you!",
                      "Loretta suddenly leans over, as she keeps attacking your cock with her legs, bringing her unhinged, terrifying visage next to your face.",
                      "ChangeImageLayer", "Expression", "1", "DangerousGlint",
                      "Speaks", "But you see... I may be persuaded to let you use my wet, tight pussy... Unload all your lustful desires into my waiting womb... Now how would you like that, mm?♥",
                      "ChangeImageLayer", "Expression", "1", "EvilSmile",
                      "Speaks", "If you let me bite you... You get to creampie my pure, priestessly pussy all you want. It will feel amazing. I know you're already hooked on my pussy.♥ And you will get to cum inside it as much as you want...♥",
                      "Loretta shifts her hips upwards, now rubbing the tip of your cock against her moist entrance... You can't help but gulp down nervously, the deal she offers is so tempting...",
                      "ChangeImageLayer", "Expression", "1", "CrimsonGaze",
                      "Speaks", "What do you say?",
                      "Menu",
                        "Agree to get bitten.",
                        "Turn down the offer",
                      "EndLoop"
                    ]
                  },
                  {
                    "NameOfScene": "Agree to get bitten.",
                    "theScene": [
                      "ChangeImageLayer", "Expression", "1", "EnchantingGaze",
                      "Speaks", "Hahyaaa...♥",
                      "PlayVisualEffect", "ScreenPulse", "../Mods/Pale Priestess/Images/FangedKissy.png",
                      "Loretta wastes no time sinking her fangs into your neck, just as your cock sinks into the moist depths of her delightful pussy, knocking softly against her womb.",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "PlayVisualEffect", "ScreenPulse", "../Mods/Pale Priestess/Images/FangedKissy.png",
                      "You don't feel much pain from bite, only the heat of your blood rushing out and getting absorbed by the deathly cold emanating from her hungry maw. You don't mind this uncanny chill of death, because your engorged cock feels like it's on fire, already spurting a massive load of hot seed into Loretta's waiting womb.",
                      "PlayVisualEffect", "ScreenPulse", "../Mods/Pale Priestess/Images/FangedKissy.png",
                      "Speaks", "Mmhph...♥ Tashty blood...♥",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "Loretta bounces her womanly hips in your lap, each movement drawing another pleasurable spurt from your cock, flooding and overfilling her welcoming womb with seed. Ropes of thick seed keep erupting from your dick, endlessly and abudantly, as if she didn't wring you dry during the fight just now.",
                      "Your eyes start rolling back from the amazing orgasms, your cock continiously climaxing inside the undead pussy and seemingly unable to stop. A large pool of cum forms over your mashing crotches, adding loud squelching noises to your animalistic copulation.",
                      "But you don't hear that anymore, your consciousness already slipping as your mind starts shutting down from the intense pleasure. What you hear are Loretta's loud gulps, moans and euphoric giggling as she drinks up your blood...",
                      "PlayBlackOut",
                      "Everything grows dark... And finally, one last sentence slips into your rapidly shutting down mind...",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Pain", "5",
                      "ChangeSensitivity", "Sex", "3",
                      "GameOver"
                    ]
                  },
                  {
                    "NameOfScene": "Turn down the offer",
                    "theScene": [
                      "ChangeImageLayer", "Expression", "1", "Amused",
                      "Speaks", "Huhu... Is that so?",
                      "ChangeImageLayer", "Expression", "1", "SmugSmile",
                      "Speaks", "Are you that afraid of the scary vampire...? Or maybe my taunts stung a little too much, mm? Decided to be a real Hero for once? Almost commendable.",
                      "ChangeImageLayer", "Expression", "1", "Disdain",
                      "Speaks", "Unless it's just your pride talking.",
                      "ChangeImageLayer", "Expression", "1", "EnchantingGaze",
                      "Speaks", "Now cum.",
                      "ChangeImageLayer", "Expression", "1", "CrimsonGaze",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "Your cock erupts at her command, splattering her stomach, the underside of her tits and raining hot, white seed all over her soft thighs in one go. But it doesn't end there, more and more sticky white stuff rushing out from your defeated dick, pooling up in the soft, creamy valley between her supple thighs.",
                      "Loretta cackles manically as she leans back, quickly bouncing her hips and sliding her smooth, cum-smeared thighs up and down your helplessly orgasming shaft, drawing more and more ejaculations from you. Already losing consciousness, you still can't look away from her pale legs as they're mercilessly attacking your cock...",
                      "PlayBlackOut",
                      "And as you finally pass out, one last sentence slips into your rapidly shutting down mind...",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Sex", "5",
                      "GameOver"
                    ]
                  },
                  {
                    "NameOfScene": "FaceSitLoss",
                    "theScene": [
                      "ChangeImageLayer", "Face", "1", "",
                      "With your cock raising its final white flag, sputtering hot seed all over the floor, you slump to the ground in defeat. You couldn't remove Loretta's wonderful ass from your face, and now you don't want to.",
                      "Loretta's addictive floral fragrance dominates your senses completely, and with her wonderful, soft ass resting on your face, you couldn't wish for anything more. Greedily, you start huffing and panting beneath her, your cock shamelessly growing hard again, as if it could still resist.",
                      "ChangeImageLayer", "Expression", "1", "Boredom",
                      "Speaks", "All out of fighting spirit already? Hmph...",
                      "Loretta raises her ass from your face, causing you to protest weakly. You raise your hands needily, even though her divine rump is already too far above, even though it's completely out of your reach, you need it... But in the end, you can only slump down with a weak moan.",
                      "ChangeImageLayer", "Expression", "1", "AngerSubdued",
                      "Speaks", "Oh do be quiet, or I'll just leave you here.",
                      "ChangeImageLayer", "Expression", "1", "Boredom",
                      "ChangeImageLayer", "Base", "1", "BaseBottomless",
                      "You promptly shut up, your fuzzy and confused mind mildly terrified at the idea of being removed from the wonderfully-smelling vampiress. In silent awe, you watch as Loretta pulls off her lacy panties before sitting on your face again, presenting her bare pussy to your already lapping tongue.",
                      "The direct smell of her bare pussy is different. More intense, erotic... intoxicating. You huff needily, eager for more of the wondorous fragrance... As her wonderful juices finally grace your tongue, your lust flares up, cock almost leaking more seed on the spot.",
                      "Speaks", "I don't want this to take too long, so here, help yourself.",
                      "Something soft and silky falls over your throbbing manhood. Quickly, you realize that she tossed her panties at it, and even more needy excitement starts building inside of you.",
                      "ChangeImageLayer", "Expression", "1", "SmugGrin",
                      "Speaks", "Start masturbating. My panties should be all you need, seeing how you managed to lose to my smell alone.",
                      "PlayLoopingSoundEffect", "sfx/Erotic/Hand/Handjob (high speed).wav",
                      "Not feeling even a little conflicted, you instantly grip your dick with shaking hands, reveling at the silky soft touch of her underwear. Lapping up her sweet juices desperately, you start furiously beating yourself off with her panties, the fetishistic lust surging and flooding your mind.",
                      "Her soft pussy is slowly drooling sweet juice, but only a little, indicating how the priestess is absolutely composed and in control of her lusts. Your head begins to spin from her delightful scent and taste, and your intense masturbation, leaving you panting and grunting like a needy animal, your hand a white blur around your cock.",
                      "ChangeImageLayer", "Expression", "1", "Boredom",
                      "Speaks", "Hmph... You're like a monkey. Do I have to teach you how to masturbate properly now? Slow down.",
                      "PlayLoopingSoundEffect", "sfx/Erotic/Hand/Handjob (medium speed).wav",
                      "She grinds her pussy into your face to insist on her demand. You whine weakly and somehow manage to stroke slower, waiting for further commands despite all-consuming lust raging in your prone form.",
                      "ChangeImageLayer", "Expression", "1", "Smile",
                      "Speaks", "Good. Now spread your legs a little wider. Long, smooth strokes, from base to the tip. One-two, one-two...",
                      "You start masturbating following her instructions, settling on a slow pace with long strokes. Being slower, it shouldn't feel better than before, but it does, so much that you already feel like cumming right now. You feel extremely excited to follow her commands, even for something quite embarrassing like this...",
                      "Speaks", "See? Isn't this much, much better? I know you feel like cumming already, but try to endure. We've only just started.",
                      "You grit your teeth, trying to please your vampiric 'instructor', stroking your cock slowly and licking up her juices, trying not to think about cumming, focusing entirely on her demands.",
                      "ChangeImageLayer", "Face", "1", "Flush",
                      "Speaks", "Up and down, up and down... Fap-fap-fap... Now speed up, and I want you to focus on your glans. Play with your tip for me.",
                      "You follow her command, switching to teasing your sensitive tip with the silky-smooth lingerie, fighting off the intense desire to orgasm, unable to even grit your teeth as you're focused on servicing her pale pussy. Loretta coos and rewards your effort with an affectionate caress, running her hand over your abdomen.",
                      "Speaks", "Delightful. Doesn't it feel good to stroke in tact to my voice? Each and every word I utter a stroke on your cock? To show off your shameful masturbation to your Mistress?",
                      "It does. It feels amazing to stroke and tease yourself, knowing that she's watching, that she is pleased by your obedience. But it is too much, the desire to cum causes you to whine and howl beneath her, stuck on the verge of an incredibly powerful orgasm, unable to hold back anymore but also incapable of disobeying her orders.",
                      "ChangeImageLayer", "Expression", "1", "LewdGrin",
                      "Speaks", "Are you about to cum? Can't take it anymore? Ah, you did a good job enduring so far, so go ahead. Loretta is watching. Show me your ejaculation.",
                      "PlayerOrgasm",
                      "StopSoundEffectLoop",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "The moment you are allowed release, you erupt into the silky underwear, flooding the lacy apparel, thoroughly staining them with sticky hot seed. Your cum just keeps rushing out, dripping down on your crotch as it couldn't get absorbed by the tiny piece of her clothes.",
                      "Speaks", "Good, good... Soil my pure, pristine panties thoroughly, mark them with your dirty seed... You lustful, perverted animal.",
                      "Rope after rope of cum shoots out of your stiff manhood, some caught in the cloth, the rest drooling down unto your crotch, creating a wet, sticky mess. Your mind can't take any more stimulation, quickly shutting down from Loretta's overbearing fragrance and the intense orgasm...",
                      "PlayBlackOut",
                      "As the world grows dim... One last instruction leaks into your defeated mind...",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Sex", "5",
                      "GameOver"
                    ]
                  },
                  {
                    "NameOfScene": "FeedingFootjob",
                    "theScene": [
                      "With another mind-bending orgasm your cock erupts with the last of your energy, raining white all around. Loretta nibbles at your ear softly, causing you to moan weakly, and the last of your resistance crumbles.",
                      "Speaks", "It only gets better from now...",
                      "You whine a little as her feet leave your cock. You feel her bare leg rest on your thigh for a moment, but not the other. You do hear ruffling of cloth, however, and dimly realize she must be taking off her other stocking...",
                      "Next moment you know that she did, as the stocking slips over your mouth like a makeshift gag. You gasp and moan as more of her stuffy foot-scent invades your senses, but the gag muffles your helpless pants.",
                      "Speaks", "Shh... Breathe deeper and enjoy yourself, thrall. I know my smell is irresistable.",
                      "Not having a choice or the strength to resist, you have to do as she says. Gasping for more air, you only get more and more of her overbearing fragrance instead, the bittersweet scent threatening to make you spurt another shameful load for her amusement.",
                      "Speaks", "You also get to have bareback sex with my priestessly feet... Aren't you glad?♥",
                      "PlayLoopingSoundEffect", "sfx/Erotic/Feet/kuchaLong03.wav",
                      "You can't deny your desire as her soft and slightly damp feet grip your cock. You whine and thrust your hips upwards, your sensitive, defeated cock seeking even more pleasure. Loretta coos in your ear and starts to jack off your cock with her feet slowly.",
                      "As your cock grows ever stiffer, the rest of your body seems to lose more and more strength, weakly relaxing in Loretta's cradling embrace. You lean back against her soft tits, deprived of vision, your helpless moans muffled by her silky stocking. Your senses seem to focus completely on her almost suffocating smell, and the sublime touch of her feet on your cock.",
                      "Speaks", "All comfortable? You should start cumming then, my little thrall.",
                      "PlayLoopingSoundEffect", "sfx/Erotic/Feet/kucha03.wav",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "You obey without a second thought, your cock erupting as soon as you hear the command. You gasp into the stocking as your cock seems to erupt far more than usual, launching a huge load into the air that rains back on your crotch, and likely at her stroking feet.",
                      "Her feet are sliding effortlessly over your engorged cock, her soft toes greedily gripping at the underside of your cock. Each time her big toes brush against the underside of your glans, a rope of thick spunk comes rushing out into the air, as if your wild ejaculation is entirely controlled by her footjob.",
                      "Speaks", "Huhuhu, you're making a mess... Now, do it again. You need to cum even more to feel better.",
                      "PlayerOrgasm",
                      "PlaySoundEffect2", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "Not expecting it yourself, you do cum again, your cock seemingly under her complete control. Your loud moan makes it through the gag, as you shudder and shiver in her grasp. Loretta catches your over-sensitive glans between her big and index toes, while expertly stroking your shaft with her other foot.",
                      "You babble in incoherent pleasure as your cock seems to become completely loose, dribbling a constant stream of cum as her divine feet tease at your overly-stimulated length. Loretta cackles quietly as she keeps squeezing this abnormal ejaculation out of your cock, never easing up on the stimulation, just as you deeply desired.",
                      "StopSoundEffectLoop",
                      "Unable to stand more pleasure, your cock finally goes limp, still grasped by her bare feet. You'd expect your recall stone to activate by now, but instead you feel more and more needy desire towards your vampiric mistress. You shiver with pleasure as her hands wrap around your chest, propping you upright against her as she leans to whisper in your ear again, her tone dripping with obscene arousal.",
                      "Speaks", "My little thrall... Your Mistress Loretta is so, so {color=#DC143C}hungry{/color}...♥ I promise it will feel even {i}better{/i}... So could you offer some blood for me, mm?♥",
                      "You only manage a muffled groan in response, your confused, overwhelmed mind still trying to process her offer.",
                      "Speaks", "You don't have to say anything... Only how you feel matters.",
                      "You feel her breath on your neck... it is cold, unnatural, scary. A vision of her demonic fangs flashes in your mind, undoubtedly they are mere inches away from your neck. You...",
                      "Menu",
                        "Don't let her bite.",
                        "Let her bite you...",
                      "EndLoop"
                    ]
                  },
                  {
                    "NameOfScene": "Don't let her bite.",
                    "theScene": [
                      "Speaks", "I see. So greedy.",
                      "Her tone is cold, disappointed. It rends your heart as you are still enamored with your vampiric mistress, but the choice is made. Her feet leave your cock, leaving you feeling cold without her touch.",
                      "Speaks", "Then I have nothing else for you either. Spew out the remains by yourself, {i}thrall{/i}.",
                      "PlayerOrgasm",
                      "PlaySoundEffect", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "You whine in protest, but cannot disobey. Your cock starts spurting weakly unto the ground, even while flaccid. The sensation is quite strange and unsatisfying, but takes the last bit of your energy as you feel the recall stone activating.",
                      "As your consciousness grows dim, you hear Loretta sighing languidly. How miserable she sounds...",
                      "PlayBlackOut",
                      "Everything goes black. One last sentence slips into your rapidly shutting down mind...",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Sex", "7",
                      "ChangeFetish", "Feet", "10",
                      "GameOver"
                    ]
                  },
                  {
                    "NameOfScene": "Let her bite you...",
                    "theScene": [
                      "PlayVisualEffect", "ScreenPulse", "../Mods/Pale Priestess/Images/FangedKissy.png",
                      "You feel her teeth touch your neck, a gentle pinprick at first quickly turning into a deeper bite. It doesn't hurt much, likely from the barrier's effects, but it feels cold, so cold, as if death itself just dug its teeth into your neck. You feel your blood rushing out, its heat warming up the bite spot ever so slightly.",
                      "Speaks", "Mmmh...♥",
                      "PlayVisualEffect", "ScreenPulse", "../Mods/Pale Priestess/Images/FangedKissy.png",
                      "Loretta moans happily as she gulps down your blood. You feel her hands shiver on your shoulders, something very different from her normal death-like stillness.",
                      "Her elated voice fills your heart with joy. She doesn't sound this genuine or happy about anything else. It feels right to feed her, to be her thrall. Despite the fact that you are losing blood, your cock springs to attention again, twice as excited as it was before.",
                      "PlayLoopingSoundEffect", "sfx/Erotic/Feet/kuchaLong03.wav",
                      "Despite being lost in the 'feeding', Loretta starts moving her feet over your shaft. It does feel like she is a little distracted, but you don't mind, every touch of your vampiric mistress bringing you great joy. Your manhood feels even more sensitive than before, but not in an overwhelming way.",
                      "Loretta is very affectionate with her touch now. Her feet glide gently over your cock, as if caressing you appreciatively. It no longer feels like a one-sided assault anymore, her gentle touch more akin to a lover's, making your heart flutter even as you're bleeding out.",
                      "PlayerOrgasm",
                      "PlaySoundEffect2", "sfx/Erotic/Ejaculation/Ejaculation sound go out (long) 1.wav",
                      "StopSoundEffectLoop",
                      "Finally, your cock erupts in a blissful orgasm, splattering her pale feet with your warm cum. Loretta stops drinking, softly pulling her fangs from your neck with a quiet sigh. The deathly cold you felt is replaced by her hot, passionate panting.",
                      "Speaks", "T-thank you...",
                      "You don't manage to respond, completely spent and feeling the recall stone activating, but feel just as appreciative of her. Loretta remains unusually tender to the end, her hands caressing your limp body softly as you slowly disappear...",
                      "PlayBlackOut",
                      "One last sentence slips into your rapidly shutting down mind...",
                      "Speaks", "You will come visit me again... And tell no one else of me...",
                      "ChangeSensitivity", "Pain", "7",
                      "ChangeSensitivity", "Sex", "5",
                      "ChangeFetish", "Feet", "10",
                      "GameOver"
                    ]
                  }
                ]
}
